
const Discord = module.require("discord.js");
const fs = require('fs');

module.exports.run = async (bot,message,args) => {
    if (args == 1)
        message.channel.send('**§1: Правила сервера** \n1.1. Запрещено оскорблять и провоцировать других юзеров, вести себя неадекватно \n1.2. Запрещены ложные жалобы \n1.3. Запрещены спам, флуд, флейм \n1.4. Запрещено публиковать незаконный и откровенный контент \n1.5. Запрещена реклама и ссылки на дискорд-сервера, также в личные сообщения участникам \n1.6. Запрещено массовое/беспричинное упоминание \n1.7. Запрещена пропаганда суицидальных/экстремистских/расистских/националистических идей \n1.8. Запрещено распространение нелицензионного ПО/читов и т.п. \n1.9. Запрещено создание визуально похожих двойников');
    if (args == 2)
        message.channel.send('**§2: Правила модерации** \n2.1. Запрещено злоупотреблять модераторскими и администаторскими функциями и использовать их в случае, когда подвергнутый им человек не нарушал правил \n2.2. Запрещено угрожать применением модераторских функций в случае соблюдения человеком правил \n2.3. Запрещено нарушать систему выдачи наказаний. (Исключения см. 2.4) \n2.4. Исключение из правила 2.3 составляют правила 1.5 и 1.4, 1.7 и 2.1 \n```Система выдачи наказаний \n> Варн -> мут -> кик -> бан день ->бан неделя -> бан навсегда```')
    if (args == 3) 
        message.channel.send('**§3: Голосовые каналы** \n3.1. Запрещено издавать звуки, мешающие общению в войсе \n3.2. Запрещено мешать другим юзерам слушать музыку(пропускать их трек и т.п) \n3.3. Пользоваться музыкальным ботом можно только в  голосовом канале "Музыка", заказ производится в #🔉¦заказ-музыки');
    message.channel.send('Примечания: \n```Администрация вправе самостоятельно принимать решение о том, является поведение неадекватным. \n\nПри изменении правил администрация сообщит участникам об этом \n\n\nСписок правил может дополняться```');
};

module.exports.help = {
    name: 'server-rules'
};